[Survived] UnaryOperator
src/app/classes/Board.ts:15:24
   ]
 
   private rouletteWheel: RouletteWheel
-  private spunNumber = -1
+  private spunNumber = +1
 
   constructor(wheel: RouletteWheel) {

[Killed] BlockStatement
src/app/classes/Board.ts:17:37
   private rouletteWheel: RouletteWheel
   private spunNumber = -1
 
-  constructor(wheel: RouletteWheel) {
-    this.rouletteWheel = wheel
-  }
+  constructor(wheel: RouletteWheel) {}
 
   public roll(betMoney: number, betType: BetType, betNumber?: number): number {
killedBy: Board Bet ONE_NUMBER win; Board Bet 0 win
statusReason: TypeError: Cannot read properties of undefined (reading 'spin')

[Killed] BlockStatement
src/app/classes/Board.ts:21:79
     this.rouletteWheel = wheel
   }
 
-  public roll(betMoney: number, betType: BetType, betNumber?: number): number {
-    this.nextSpin()
-    return this.calculatePay(betType, betMoney, betNumber)
-  }
+  public roll(betMoney: number, betType: BetType, betNumber?: number): number {}
 
   private nextSpin() {
killedBy: Board Bet ONE_NUMBER win; Board Bet 0 win
statusReason: Error: Expected undefined to equal 3600.

[Killed] BlockStatement
src/app/classes/Board.ts:26:22
     return this.calculatePay(betType, betMoney, betNumber)
   }
 
-  private nextSpin() {
-    this.spunNumber = this.rouletteWheel.spin()
-  }
+  private nextSpin() {}
 
   private calculatePay(
killedBy: Board Bet ONE_NUMBER win; Board Bet 0 win
statusReason: Error: Expected 0 to equal 3600.

[Killed] BlockStatement
src/app/classes/Board.ts:34:13
     betType: BetType,
     betMoney: number,
     betNumber: number | undefined
-  ): number {
-    return this.spunNumber === 0
-      ? this.calculateZeroCasePay(betType, betMoney, betNumber)
-      : this.calculateNormalCasePay(betType, betMoney, betNumber)
-  }
+  ): number {}
 
   private calculateZeroCasePay(
killedBy: Board Bet ONE_NUMBER win; Board Bet 0 win
statusReason: Error: Expected undefined to equal 3600.

[Killed] ConditionalExpression
src/app/classes/Board.ts:35:12
     betMoney: number,
     betNumber: number | undefined
   ): number {
-    return this.spunNumber === 0
+    return false
       ? this.calculateZeroCasePay(betType, betMoney, betNumber)
       : this.calculateNormalCasePay(betType, betMoney, betNumber)
killedBy: Board Bet 0 win
statusReason: Error: Bet type not supported

[Killed] EqualityOperator
src/app/classes/Board.ts:35:12
     betMoney: number,
     betNumber: number | undefined
   ): number {
-    return this.spunNumber === 0
+    return this.spunNumber !== 0
       ? this.calculateZeroCasePay(betType, betMoney, betNumber)
       : this.calculateNormalCasePay(betType, betMoney, betNumber)
killedBy: Board Bet PASSE win; Board Bet 0 win
statusReason: Error: Expected 0 to equal 200.

[Killed] BlockStatement
src/app/classes/Board.ts:44:13
     betType: BetType,
     betMoney: number,
     betNumber: number | undefined
-  ): number {
-    if (betType === BetType.ONE_NUMBER) {
-      return this.calculateOneNumberCasePay(betNumber, betMoney)
-    }
-    return 0
-  }
+  ): number {}
 
   private calculateNormalCasePay(
killedBy: Board Bet 0 win
statusReason: Error: Expected undefined to equal 3600.

[Killed] BlockStatement
src/app/classes/Board.ts:45:41
     betMoney: number,
     betNumber: number | undefined
   ): number {
-    if (betType === BetType.ONE_NUMBER) {
-      return this.calculateOneNumberCasePay(betNumber, betMoney)
-    }
+    if (betType === BetType.ONE_NUMBER) {}
     return 0
   }
killedBy: Board Bet 0 win
statusReason: Error: Expected 0 to equal 3600.

[Killed] ConditionalExpression
src/app/classes/Board.ts:45:9
     betMoney: number,
     betNumber: number | undefined
   ): number {
-    if (betType === BetType.ONE_NUMBER) {
+    if (false) {
       return this.calculateOneNumberCasePay(betNumber, betMoney)
     }
killedBy: Board Bet 0 win
statusReason: Error: Expected 0 to equal 3600.

[Killed] LogicalOperator
src/app/classes/Board.ts:56:9
     betMoney: number,
     betNumber: number | undefined
   ): number {
-    if (betType === BetType.ONE_NUMBER && betNumber) {
+    if (betType === BetType.ONE_NUMBER || betNumber) {
       return this.calculateOneNumberCasePay(betNumber, betMoney)
     }
killedBy: Board Bet SIX_NUMBERS win
statusReason: Error: Expected 0 to equal 600.

[Killed] ConditionalExpression
src/app/classes/Board.ts:56:9
     betMoney: number,
     betNumber: number | undefined
   ): number {
-    if (betType === BetType.ONE_NUMBER && betNumber) {
+    if (false) {
       return this.calculateOneNumberCasePay(betNumber, betMoney)
     }
killedBy: Board Bet ONE_NUMBER win
statusReason: Error: Bet type not supported

[Killed] ConditionalExpression
src/app/classes/Board.ts:59:9
     if (betType === BetType.ONE_NUMBER && betNumber) {
       return this.calculateOneNumberCasePay(betNumber, betMoney)
     }
-    if (betType === BetType.PASSE) {
+    if (true) {
       return this.calculatePasseCasePay(betMoney)
     }
killedBy: Board Bet MANQUE win
statusReason: Error: Expected 0 to equal 200.

[Killed] EqualityOperator
src/app/classes/Board.ts:59:9
     if (betType === BetType.ONE_NUMBER && betNumber) {
       return this.calculateOneNumberCasePay(betNumber, betMoney)
     }
-    if (betType === BetType.PASSE) {
+    if (betType !== BetType.PASSE) {
       return this.calculatePasseCasePay(betMoney)
     }
killedBy: Board Bet PASSE win
statusReason: Error: Bet type not supported

[Killed] ConditionalExpression
src/app/classes/Board.ts:62:9
     if (betType === BetType.PASSE) {
       return this.calculatePasseCasePay(betMoney)
     }
-    if (betType === BetType.MANQUE) {
+    if (true) {
       return this.calculateManqueCasePay(betMoney)
     }
killedBy: Board Bet PAIR loose
statusReason: Error: Expected 200 to equal 0.

[Killed] BlockStatement
src/app/classes/Board.ts:62:37
     if (betType === BetType.PASSE) {
       return this.calculatePasseCasePay(betMoney)
     }
-    if (betType === BetType.MANQUE) {
-      return this.calculateManqueCasePay(betMoney)
-    }
+    if (betType === BetType.MANQUE) {}
     if (betType === BetType.PAIR) {
       return this.calculatePairCasePay(betMoney)
killedBy: Board Bet MANQUE win
statusReason: Error: Bet type not supported

[Killed] ConditionalExpression
src/app/classes/Board.ts:65:9
     if (betType === BetType.MANQUE) {
       return this.calculateManqueCasePay(betMoney)
     }
-    if (betType === BetType.PAIR) {
+    if (false) {
       return this.calculatePairCasePay(betMoney)
     }
killedBy: Board Bet PAIR win
statusReason: Error: Bet type not supported

[Killed] EqualityOperator
src/app/classes/Board.ts:65:9
     if (betType === BetType.MANQUE) {
       return this.calculateManqueCasePay(betMoney)
     }
-    if (betType === BetType.PAIR) {
+    if (betType !== BetType.PAIR) {
       return this.calculatePairCasePay(betMoney)
     }
killedBy: Board Bet PAIR win
statusReason: Error: Bet type not supported

[Killed] EqualityOperator
src/app/classes/Board.ts:68:9
     if (betType === BetType.PAIR) {
       return this.calculatePairCasePay(betMoney)
     }
-    if (betType === BetType.IMPAIR) {
+    if (betType !== BetType.IMPAIR) {
       return this.calculateImpairCasePay(betMoney)
     }
killedBy: Board Bet IMPAIR win
statusReason: Error: Bet type not supported

[Killed] BlockStatement
src/app/classes/Board.ts:68:37
     if (betType === BetType.PAIR) {
       return this.calculatePairCasePay(betMoney)
     }
-    if (betType === BetType.IMPAIR) {
-      return this.calculateImpairCasePay(betMoney)
-    }
+    if (betType === BetType.IMPAIR) {}
     if (betType === BetType.RED) {
       return this.calculateRedNumberCasePay(betMoney)
killedBy: Board Bet IMPAIR win
statusReason: Error: Bet type not supported

[Killed] ConditionalExpression
src/app/classes/Board.ts:71:9
     if (betType === BetType.IMPAIR) {
       return this.calculateImpairCasePay(betMoney)
     }
-    if (betType === BetType.RED) {
+    if (true) {
       return this.calculateRedNumberCasePay(betMoney)
     }
killedBy: Board Bet BLACK win
statusReason: Error: Expected 0 to equal 200.

[Killed] EqualityOperator
src/app/classes/Board.ts:71:9
     if (betType === BetType.IMPAIR) {
       return this.calculateImpairCasePay(betMoney)
     }
-    if (betType === BetType.RED) {
+    if (betType !== BetType.RED) {
       return this.calculateRedNumberCasePay(betMoney)
     }
killedBy: Board Bet RED win
statusReason: Error: Bet type not supported

[Killed] BlockStatement
src/app/classes/Board.ts:74:36
     if (betType === BetType.RED) {
       return this.calculateRedNumberCasePay(betMoney)
     }
-    if (betType === BetType.BLACK) {
-      return this.calculateBlackNumberCasePay(betMoney)
-    }
+    if (betType === BetType.BLACK) {}
     if (betType === BetType.PREMIER) {
       return this.calculatePremierCasePay(betMoney)
killedBy: Board Bet BLACK win
statusReason: Error: Bet type not supported

[Killed] ConditionalExpression
src/app/classes/Board.ts:74:9
     if (betType === BetType.RED) {
       return this.calculateRedNumberCasePay(betMoney)
     }
-    if (betType === BetType.BLACK) {
+    if (false) {
       return this.calculateBlackNumberCasePay(betMoney)
     }
killedBy: Board Bet BLACK win
statusReason: Error: Bet type not supported

[Killed] ConditionalExpression
src/app/classes/Board.ts:77:9
     if (betType === BetType.BLACK) {
       return this.calculateBlackNumberCasePay(betMoney)
     }
-    if (betType === BetType.PREMIER) {
+    if (true) {
       return this.calculatePremierCasePay(betMoney)
     }
killedBy: Board Bet MOYEN win
statusReason: Error: Expected 0 to equal 300.

[Killed] BlockStatement
src/app/classes/Board.ts:77:38
     if (betType === BetType.BLACK) {
       return this.calculateBlackNumberCasePay(betMoney)
     }
-    if (betType === BetType.PREMIER) {
-      return this.calculatePremierCasePay(betMoney)
-    }
+    if (betType === BetType.PREMIER) {}
     if (betType === BetType.MOYEN) {
       return this.calculateMoyenCasePay(betMoney)
killedBy: Board Bet PREMIER win
statusReason: Error: Bet type not supported

[Killed] EqualityOperator
src/app/classes/Board.ts:80:9
     if (betType === BetType.PREMIER) {
       return this.calculatePremierCasePay(betMoney)
     }
-    if (betType === BetType.MOYEN) {
+    if (betType !== BetType.MOYEN) {
       return this.calculateMoyenCasePay(betMoney)
     }
killedBy: Board Bet MOYEN win
statusReason: Error: Bet type not supported

[Killed] ConditionalExpression
src/app/classes/Board.ts:80:9
     if (betType === BetType.PREMIER) {
       return this.calculatePremierCasePay(betMoney)
     }
-    if (betType === BetType.MOYEN) {
+    if (true) {
       return this.calculateMoyenCasePay(betMoney)
     }
killedBy: Board Bet DERNIER win
statusReason: Error: Expected 0 to equal 300.

[Killed] EqualityOperator
src/app/classes/Board.ts:83:9
     if (betType === BetType.MOYEN) {
       return this.calculateMoyenCasePay(betMoney)
     }
-    if (betType === BetType.DERNIER) {
+    if (betType !== BetType.DERNIER) {
       return this.calculateDernierCasePay(betMoney)
     }
killedBy: Board Bet DERNIER win
statusReason: Error: Bet type not supported

[Killed] ConditionalExpression
src/app/classes/Board.ts:83:9
     if (betType === BetType.MOYEN) {
       return this.calculateMoyenCasePay(betMoney)
     }
-    if (betType === BetType.DERNIER) {
+    if (false) {
       return this.calculateDernierCasePay(betMoney)
     }
killedBy: Board Bet DERNIER win
statusReason: Error: Bet type not supported

[Killed] ConditionalExpression
src/app/classes/Board.ts:86:9
     if (betType === BetType.DERNIER) {
       return this.calculateDernierCasePay(betMoney)
     }
-    if (betType === BetType.TOP_COLUMN) {
+    if (true) {
       return this.calculateTopColumnCasePay(betMoney)
     }
killedBy: Board Bet MIDDLE_COLUMN win
statusReason: Error: Expected 0 to equal 300.

[Killed] ConditionalExpression
src/app/classes/Board.ts:86:9
     if (betType === BetType.DERNIER) {
       return this.calculateDernierCasePay(betMoney)
     }
-    if (betType === BetType.TOP_COLUMN) {
+    if (false) {
       return this.calculateTopColumnCasePay(betMoney)
     }
killedBy: Board Bet TOP_COLUMN win
statusReason: Error: Bet type not supported

[Killed] ConditionalExpression
src/app/classes/Board.ts:89:9
     if (betType === BetType.TOP_COLUMN) {
       return this.calculateTopColumnCasePay(betMoney)
     }
-    if (betType === BetType.MIDDLE_COLUMN) {
+    if (false) {
       return this.calculateMiddleColumnCasePay(betMoney)
     }
killedBy: Board Bet MIDDLE_COLUMN win
statusReason: Error: Bet type not supported

[Killed] BlockStatement
src/app/classes/Board.ts:89:44
     if (betType === BetType.TOP_COLUMN) {
       return this.calculateTopColumnCasePay(betMoney)
     }
-    if (betType === BetType.MIDDLE_COLUMN) {
-      return this.calculateMiddleColumnCasePay(betMoney)
-    }
+    if (betType === BetType.MIDDLE_COLUMN) {}
     if (betType === BetType.BOTTOM_COLUMN) {
       return this.calculateBottomColumnCasePay(betMoney)
killedBy: Board Bet MIDDLE_COLUMN win
statusReason: Error: Bet type not supported

[Killed] ConditionalExpression
src/app/classes/Board.ts:92:9
     if (betType === BetType.MIDDLE_COLUMN) {
       return this.calculateMiddleColumnCasePay(betMoney)
     }
-    if (betType === BetType.BOTTOM_COLUMN) {
+    if (false) {
       return this.calculateBottomColumnCasePay(betMoney)
     }
killedBy: Board Bet BOTTOM_COLUMN win
statusReason: Error: Bet type not supported

[Killed] BlockStatement
src/app/classes/Board.ts:92:44
     if (betType === BetType.MIDDLE_COLUMN) {
       return this.calculateMiddleColumnCasePay(betMoney)
     }
-    if (betType === BetType.BOTTOM_COLUMN) {
-      return this.calculateBottomColumnCasePay(betMoney)
-    }
+    if (betType === BetType.BOTTOM_COLUMN) {}
     if (betType === BetType.SIX_NUMBERS && betNumber) {
       return this.calculateSixNumbersCasePay(betMoney, betNumber)
killedBy: Board Bet BOTTOM_COLUMN win
statusReason: Error: Bet type not supported

[Killed] EqualityOperator
src/app/classes/Board.ts:95:9
     if (betType === BetType.BOTTOM_COLUMN) {
       return this.calculateBottomColumnCasePay(betMoney)
     }
-    if (betType === BetType.SIX_NUMBERS && betNumber) {
+    if (betType !== BetType.SIX_NUMBERS && betNumber) {
       return this.calculateSixNumbersCasePay(betMoney, betNumber)
     }
killedBy: Board Bet SIX_NUMBERS win
statusReason: Error: Bet type not supported

[Killed] ConditionalExpression
src/app/classes/Board.ts:95:9
     if (betType === BetType.BOTTOM_COLUMN) {
       return this.calculateBottomColumnCasePay(betMoney)
     }
-    if (betType === BetType.SIX_NUMBERS && betNumber) {
+    if (false) {
       return this.calculateSixNumbersCasePay(betMoney, betNumber)
     }
killedBy: Board Bet SIX_NUMBERS win
statusReason: Error: Bet type not supported

[Killed] ConditionalExpression
src/app/classes/Board.ts:98:9
     if (betType === BetType.SIX_NUMBERS && betNumber) {
       return this.calculateSixNumbersCasePay(betMoney, betNumber)
     }
-    if (betType === BetType.FOUR_NUMBERS && betNumber) {
+    if (true) {
       return this.calculateFourNumbersCasePay(betMoney, betNumber)
     }
killedBy: Board Bet THREE_NUMBERS win
statusReason: Error: Expected 0 to equal 1200.

[Killed] ConditionalExpression
src/app/classes/Board.ts:98:9
     if (betType === BetType.SIX_NUMBERS && betNumber) {
       return this.calculateSixNumbersCasePay(betMoney, betNumber)
     }
-    if (betType === BetType.FOUR_NUMBERS && betNumber) {
+    if (true && betNumber) {
       return this.calculateFourNumbersCasePay(betMoney, betNumber)
     }
killedBy: Board Bet THREE_NUMBERS win
statusReason: Error: Expected 0 to equal 1200.

[Killed] EqualityOperator
src/app/classes/Board.ts:101:9
     if (betType === BetType.FOUR_NUMBERS && betNumber) {
       return this.calculateFourNumbersCasePay(betMoney, betNumber)
     }
-    if (betType === BetType.THREE_NUMBERS && betNumber) {
+    if (betType !== BetType.THREE_NUMBERS && betNumber) {
       return this.calculateThreeNumbersCasePay(betMoney, betNumber)
     }
killedBy: Board Bet THREE_NUMBERS win
statusReason: Error: Bet type not supported

[Killed] ConditionalExpression
src/app/classes/Board.ts:101:9
     if (betType === BetType.FOUR_NUMBERS && betNumber) {
       return this.calculateFourNumbersCasePay(betMoney, betNumber)
     }
-    if (betType === BetType.THREE_NUMBERS && betNumber) {
+    if (false) {
       return this.calculateThreeNumbersCasePay(betMoney, betNumber)
     }
killedBy: Board Bet THREE_NUMBERS win
statusReason: Error: Bet type not supported

[Killed] EqualityOperator
src/app/classes/Board.ts:104:9
     if (betType === BetType.THREE_NUMBERS && betNumber) {
       return this.calculateThreeNumbersCasePay(betMoney, betNumber)
     }
-    if (betType === BetType.TWO_NUMBERS_HORIZONTAL && betNumber) {
+    if (betType !== BetType.TWO_NUMBERS_HORIZONTAL && betNumber) {
       return this.calculateTwoNumbersHorizontalCasePay(betMoney, betNumber)
     }
killedBy: Board Bet TWO_NUMBERS_HORIZONTAL win
statusReason: Error: Bet type not supported

[Killed] LogicalOperator
src/app/classes/Board.ts:104:9
     if (betType === BetType.THREE_NUMBERS && betNumber) {
       return this.calculateThreeNumbersCasePay(betMoney, betNumber)
     }
-    if (betType === BetType.TWO_NUMBERS_HORIZONTAL && betNumber) {
+    if (betType === BetType.TWO_NUMBERS_HORIZONTAL || betNumber) {
       return this.calculateTwoNumbersHorizontalCasePay(betMoney, betNumber)
     }
killedBy: Board Bet TWO_NUMBERS_VERTICAL win
statusReason: Error: Expected 0 to equal 1800.

[Killed] EqualityOperator
src/app/classes/Board.ts:107:9
     if (betType === BetType.TWO_NUMBERS_HORIZONTAL && betNumber) {
       return this.calculateTwoNumbersHorizontalCasePay(betMoney, betNumber)
     }
-    if (betType === BetType.TWO_NUMBERS_VERTICAL && betNumber) {
+    if (betType !== BetType.TWO_NUMBERS_VERTICAL && betNumber) {
       return this.calculateTwoNumbersVerticalCasePay(betMoney, betNumber)
     }
killedBy: Board Bet TWO_NUMBERS_VERTICAL win
statusReason: Error: Bet type not supported

[Killed] BlockStatement
src/app/classes/Board.ts:107:64
     if (betType === BetType.TWO_NUMBERS_HORIZONTAL && betNumber) {
       return this.calculateTwoNumbersHorizontalCasePay(betMoney, betNumber)
     }
-    if (betType === BetType.TWO_NUMBERS_VERTICAL && betNumber) {
-      return this.calculateTwoNumbersVerticalCasePay(betMoney, betNumber)
-    }
+    if (betType === BetType.TWO_NUMBERS_VERTICAL && betNumber) {}
     throw new Error('Bet type not supported')
   }
killedBy: Board Bet TWO_NUMBERS_VERTICAL win
statusReason: Error: Bet type not supported

[Killed] BlockStatement
src/app/classes/Board.ts:116:5
   private calculateOneNumberCasePay(
     betNumber: number | undefined,
     betMoney: number
-  ) {
-    return this.calculatePaidMoney(
-      this.spunNumber === betNumber,
-      betMoney,
-      this.payMultiplierForOneNumber
-    )
-  }
+  ) {}
 
   private calculatePasseCasePay(betMoney: number) {
killedBy: Board Bet ONE_NUMBER win; Board Bet 0 win
statusReason: Error: Expected undefined to equal 3600.

[Killed] ConditionalExpression
src/app/classes/Board.ts:118:7
     betMoney: number
   ) {
     return this.calculatePaidMoney(
-      this.spunNumber === betNumber,
+      false,
       betMoney,
       this.payMultiplierForOneNumber
killedBy: Board Bet ONE_NUMBER win; Board Bet 0 win
statusReason: Error: Expected 0 to equal 3600.

[Killed] ConditionalExpression
src/app/classes/Board.ts:118:7
     betMoney: number
   ) {
     return this.calculatePaidMoney(
-      this.spunNumber === betNumber,
+      true,
       betMoney,
       this.payMultiplierForOneNumber
killedBy: Board Bet ONE_NUMBER loose; Board Bet 10 loose
statusReason: Error: Expected 3600 to equal 0.

[Killed] BlockStatement
src/app/classes/Board.ts:124:51
     )
   }
 
-  private calculatePasseCasePay(betMoney: number) {
-    return this.calculatePaidMoney(
-      this.spunNumber > 18,
-      betMoney,
-      this.payMultiplierForBinaryChoice
-    )
-  }
+  private calculatePasseCasePay(betMoney: number) {}
 
   private calculateManqueCasePay(betMoney: number) {
killedBy: Board Bet PASSE win
statusReason: Error: Expected undefined to equal 200.

[Killed] EqualityOperator
src/app/classes/Board.ts:126:7
 
   private calculatePasseCasePay(betMoney: number) {
     return this.calculatePaidMoney(
-      this.spunNumber > 18,
+      this.spunNumber <= 18,
       betMoney,
       this.payMultiplierForBinaryChoice
killedBy: Board Bet PASSE win
statusReason: Error: Expected 0 to equal 200.

[Killed] ConditionalExpression
src/app/classes/Board.ts:126:7
 
   private calculatePasseCasePay(betMoney: number) {
     return this.calculatePaidMoney(
-      this.spunNumber > 18,
+      true,
       betMoney,
       this.payMultiplierForBinaryChoice
killedBy: Board Bet PASSE loose
statusReason: Error: Expected 200 to equal 0.

[Killed] BlockStatement
src/app/classes/Board.ts:132:52
     )
   }
 
-  private calculateManqueCasePay(betMoney: number) {
-    return this.calculatePaidMoney(
-      this.spunNumber < 19,
-      betMoney,
-      this.payMultiplierForBinaryChoice
-    )
-  }
+  private calculateManqueCasePay(betMoney: number) {}
 
   private calculatePairCasePay(betMoney: number) {
killedBy: Board Bet MANQUE win
statusReason: Error: Expected undefined to equal 200.

[Killed] ConditionalExpression
src/app/classes/Board.ts:134:7
 
   private calculateManqueCasePay(betMoney: number) {
     return this.calculatePaidMoney(
-      this.spunNumber < 19,
+      true,
       betMoney,
       this.payMultiplierForBinaryChoice
killedBy: Board Bet MANQUE loose
statusReason: Error: Expected 200 to equal 0.

[Killed] EqualityOperator
src/app/classes/Board.ts:134:7
 
   private calculateManqueCasePay(betMoney: number) {
     return this.calculatePaidMoney(
-      this.spunNumber < 19,
+      this.spunNumber <= 19,
       betMoney,
       this.payMultiplierForBinaryChoice
killedBy: Board Bet MANQUE loose
statusReason: Error: Expected 200 to equal 0.

[Killed] BlockStatement
src/app/classes/Board.ts:140:50
     )
   }
 
-  private calculatePairCasePay(betMoney: number) {
-    return this.calculatePaidMoney(
-      this.spunNumber % 2 === 0,
-      betMoney,
-      this.payMultiplierForBinaryChoice
-    )
-  }
+  private calculatePairCasePay(betMoney: number) {}
 
   private calculateImpairCasePay(betMoney: number) {
killedBy: Board Bet PAIR win
statusReason: Error: Expected undefined to equal 200.

[Killed] ConditionalExpression
src/app/classes/Board.ts:142:7
 
   private calculatePairCasePay(betMoney: number) {
     return this.calculatePaidMoney(
-      this.spunNumber % 2 === 0,
+      true,
       betMoney,
       this.payMultiplierForBinaryChoice
killedBy: Board Bet PAIR loose
statusReason: Error: Expected 200 to equal 0.

[Killed] EqualityOperator
src/app/classes/Board.ts:142:7
 
   private calculatePairCasePay(betMoney: number) {
     return this.calculatePaidMoney(
-      this.spunNumber % 2 === 0,
+      this.spunNumber % 2 !== 0,
       betMoney,
       this.payMultiplierForBinaryChoice
killedBy: Board Bet PAIR win
statusReason: Error: Expected 0 to equal 200.

[Killed] BlockStatement
src/app/classes/Board.ts:148:52
     )
   }
 
-  private calculateImpairCasePay(betMoney: number) {
-    return this.calculatePaidMoney(
-      this.spunNumber % 2 === 1,
-      betMoney,
-      this.payMultiplierForBinaryChoice
-    )
-  }
+  private calculateImpairCasePay(betMoney: number) {}
 
   private calculateRedNumberCasePay(betMoney: number) {
killedBy: Board Bet IMPAIR win
statusReason: Error: Expected undefined to equal 200.

[Killed] ArithmeticOperator
src/app/classes/Board.ts:150:7
 
   private calculateImpairCasePay(betMoney: number) {
     return this.calculatePaidMoney(
-      this.spunNumber % 2 === 1,
+      this.spunNumber * 2 === 1,
       betMoney,
       this.payMultiplierForBinaryChoice
killedBy: Board Bet IMPAIR win
statusReason: Error: Expected 0 to equal 200.

[Killed] ConditionalExpression
src/app/classes/Board.ts:150:7
 
   private calculateImpairCasePay(betMoney: number) {
     return this.calculatePaidMoney(
-      this.spunNumber % 2 === 1,
+      false,
       betMoney,
       this.payMultiplierForBinaryChoice
killedBy: Board Bet IMPAIR win
statusReason: Error: Expected 0 to equal 200.

[Killed] BlockStatement
src/app/classes/Board.ts:156:55
     )
   }
 
-  private calculateRedNumberCasePay(betMoney: number) {
-    return this.calculatePaidMoney(
-      this.isRedNumber(),
-      betMoney,
-      this.payMultiplierForBinaryChoice
-    )
-  }
+  private calculateRedNumberCasePay(betMoney: number) {}
 
   private calculateBlackNumberCasePay(betMoney: number) {
killedBy: Board Bet RED win
statusReason: Error: Expected undefined to equal 200.

[Killed] BlockStatement
src/app/classes/Board.ts:164:57
     )
   }
 
-  private calculateBlackNumberCasePay(betMoney: number) {
-    return this.calculatePaidMoney(
-      this.isBlackNumber(),
-      betMoney,
-      this.payMultiplierForBinaryChoice
-    )
-  }
+  private calculateBlackNumberCasePay(betMoney: number) {}
 
   private calculatePremierCasePay(betMoney: number) {
killedBy: Board Bet BLACK win
statusReason: Error: Expected undefined to equal 200.

[Killed] BlockStatement
src/app/classes/Board.ts:172:53
     )
   }
 
-  private calculatePremierCasePay(betMoney: number) {
-    return this.calculatePaidMoney(
-      this.isPremier(),
-      betMoney,
-      this.payMultiplierForTernaryChoice
-    )
-  }
+  private calculatePremierCasePay(betMoney: number) {}
 
   private calculateMoyenCasePay(betMoney: number) {
killedBy: Board Bet PREMIER win
statusReason: Error: Expected undefined to equal 300.

[Killed] BlockStatement
src/app/classes/Board.ts:180:51
     )
   }
 
-  private calculateMoyenCasePay(betMoney: number) {
-    return this.calculatePaidMoney(
-      this.isMoyen(),
-      betMoney,
-      this.payMultiplierForTernaryChoice
-    )
-  }
+  private calculateMoyenCasePay(betMoney: number) {}
 
   private calculateDernierCasePay(betMoney: number) {
killedBy: Board Bet MOYEN win
statusReason: Error: Expected undefined to equal 300.

[Killed] BlockStatement
src/app/classes/Board.ts:188:53
     )
   }
 
-  private calculateDernierCasePay(betMoney: number) {
-    return this.calculatePaidMoney(
-      this.isDernier(),
-      betMoney,
-      this.payMultiplierForTernaryChoice
-    )
-  }
+  private calculateDernierCasePay(betMoney: number) {}
 
   private calculateTopColumnCasePay(betMoney: number) {
killedBy: Board Bet DERNIER win
statusReason: Error: Expected undefined to equal 300.

[Killed] BlockStatement
src/app/classes/Board.ts:196:55
     )
   }
 
-  private calculateTopColumnCasePay(betMoney: number) {
-    return this.calculatePaidMoney(
-      this.isTopColumn(),
-      betMoney,
-      this.payMultiplierForTernaryChoice
-    )
-  }
+  private calculateTopColumnCasePay(betMoney: number) {}
 
   private calculateMiddleColumnCasePay(betMoney: number) {
killedBy: Board Bet TOP_COLUMN win
statusReason: Error: Expected undefined to equal 300.

[Killed] BlockStatement
src/app/classes/Board.ts:204:58
     )
   }
 
-  private calculateMiddleColumnCasePay(betMoney: number) {
-    return this.calculatePaidMoney(
-      this.isMiddleColumn(),
-      betMoney,
-      this.payMultiplierForTernaryChoice
-    )
-  }
+  private calculateMiddleColumnCasePay(betMoney: number) {}
 
   private calculateBottomColumnCasePay(betMoney: number) {
killedBy: Board Bet MIDDLE_COLUMN win
statusReason: Error: Expected undefined to equal 300.

[Killed] BlockStatement
src/app/classes/Board.ts:212:58
     )
   }
 
-  private calculateBottomColumnCasePay(betMoney: number) {
-    return this.calculatePaidMoney(
-      this.isBottomColumn(),
-      betMoney,
-      this.payMultiplierForTernaryChoice
-    )
-  }
+  private calculateBottomColumnCasePay(betMoney: number) {}
 
   private calculateSixNumbersCasePay(betMoney: number, betNumber: number) {
killedBy: Board Bet BOTTOM_COLUMN win
statusReason: Error: Expected undefined to equal 300.

[Killed] BlockStatement
src/app/classes/Board.ts:220:75
     )
   }
 
-  private calculateSixNumbersCasePay(betMoney: number, betNumber: number) {
-    const winCells = this.createFixedLengthArrayFromStart(6, betNumber)
-    return this.calculatePaidMoney(
-      winCells.includes(this.spunNumber),
-      betMoney,
-      6,
-      !this.isTopColumn(betNumber)
-    )
-  }
+  private calculateSixNumbersCasePay(betMoney: number, betNumber: number) {}
 
   private calculateFourNumbersCasePay(betMoney: number, betNumber: number) {
killedBy: Board Bet SIX_NUMBERS win
statusReason: Error: Expected undefined to equal 600.

[Killed] BooleanLiteral
src/app/classes/Board.ts:226:7
       winCells.includes(this.spunNumber),
       betMoney,
       6,
-      !this.isTopColumn(betNumber)
+      this.isTopColumn(betNumber)
     )
   }
killedBy: Board Bet SIX_NUMBERS win
statusReason: Error: Bet number is not allowed for this game.

[Killed] BlockStatement
src/app/classes/Board.ts:230:76
     )
   }
 
-  private calculateFourNumbersCasePay(betMoney: number, betNumber: number) {
-    const winCells = this.createFixedLengthArrayFromStart(5, betNumber)
-    winCells.splice(2, 1)
-    return this.calculatePaidMoney(
-      winCells.includes(this.spunNumber),
-      betMoney,
-      9
-    )
-  }
+  private calculateFourNumbersCasePay(betMoney: number, betNumber: number) {}
 
   private calculateThreeNumbersCasePay(betMoney: number, betNumber: number) {
killedBy: Board Bet FOUR_NUMBERS win
statusReason: Error: Expected undefined to equal 900.
