[Killed] BlockStatement
src/app/classes/Board.ts:240:77
     )
   }
 
-  private calculateThreeNumbersCasePay(betMoney: number, betNumber: number) {
-    const winCells = this.createFixedLengthArrayFromStart(3, betNumber)
-    return this.calculatePaidMoney(
-      winCells.includes(this.spunNumber),
-      betMoney,
-      12
-    )
-  }
+  private calculateThreeNumbersCasePay(betMoney: number, betNumber: number) {}
 
   private calculateTwoNumbersHorizontalCasePay(
killedBy: Board Bet THREE_NUMBERS win
statusReason: Error: Expected undefined to equal 1200.

[Killed] BlockStatement
src/app/classes/Board.ts:252:5
   private calculateTwoNumbersHorizontalCasePay(
     betMoney: number,
     betNumber: number
-  ) {
-    const winCells = this.createFixedLengthArrayFromStart(2, betNumber)
-    return this.calculatePaidMoney(
-      winCells.includes(this.spunNumber),
-      betMoney,
-      this.payMultiplierForDoubleChoice,
-      this.isBottomColumn(betNumber)
-    )
-  }
+  ) {}
 
   private calculateTwoNumbersVerticalCasePay(
killedBy: Board Bet TWO_NUMBERS_HORIZONTAL win
statusReason: Error: Expected undefined to equal 1800.

[Killed] BlockStatement
src/app/classes/Board.ts:265:5
   private calculateTwoNumbersVerticalCasePay(
     betMoney: number,
     betNumber: number
-  ) {
-    const winCells = [betNumber, betNumber + 3]
-    return this.calculatePaidMoney(
-      winCells.includes(this.spunNumber),
-      betMoney,
-      this.payMultiplierForDoubleChoice,
-      this.isLastRow(betNumber)
-    )
-  }
+  ) {}
 
   private createFixedLengthArrayFromStart(length: number, start: number) {
killedBy: Board Bet TWO_NUMBERS_VERTICAL win
statusReason: Error: Expected undefined to equal 1800.

[Killed] ArithmeticOperator
src/app/classes/Board.ts:266:34
     betMoney: number,
     betNumber: number
   ) {
-    const winCells = [betNumber, betNumber + 3]
+    const winCells = [betNumber, betNumber - 3]
     return this.calculatePaidMoney(
       winCells.includes(this.spunNumber),
killedBy: Board Bet TWO_NUMBERS_VERTICAL win
statusReason: Error: Expected 0 to equal 1800.

[Killed] BlockStatement
src/app/classes/Board.ts:275:74
     )
   }
 
-  private createFixedLengthArrayFromStart(length: number, start: number) {
-    return Array.from({ length }, (_, i) => i + start)
-  }
+  private createFixedLengthArrayFromStart(length: number, start: number) {}
 
   private calculatePaidMoney(
killedBy: Board Bet SIX_NUMBERS win
statusReason: TypeError: Cannot read properties of undefined (reading 'includes')

[Killed] ArrowFunction
src/app/classes/Board.ts:276:35
   }
 
   private createFixedLengthArrayFromStart(length: number, start: number) {
-    return Array.from({ length }, (_, i) => i + start)
+    return Array.from({ length }, () => undefined)
   }
 
killedBy: Board Bet SIX_NUMBERS win
statusReason: Error: Expected 0 to equal 600.

[Killed] ArithmeticOperator
src/app/classes/Board.ts:276:45
   }
 
   private createFixedLengthArrayFromStart(length: number, start: number) {
-    return Array.from({ length }, (_, i) => i + start)
+    return Array.from({ length }, (_, i) => i - start)
   }
 
killedBy: Board Bet SIX_NUMBERS win
statusReason: Error: Expected 0 to equal 600.

[Killed] BooleanLiteral
src/app/classes/Board.ts:283:21
     isWin: boolean,
     betMoney: number,
     multiplier: number,
-    exceptionCase = false
+    exceptionCase = true
   ) {
     if (exceptionCase) {
killedBy: Board Bet ONE_NUMBER win; Board Bet 0 win
statusReason: Error: Bet number is not allowed for this game.

[Killed] BlockStatement
src/app/classes/Board.ts:284:5
     betMoney: number,
     multiplier: number,
     exceptionCase = false
-  ) {
-    if (exceptionCase) {
-      throw new Error(`Bet number is not allowed for this game.`)
-    }
-    return isWin ? betMoney * multiplier : this.payLostGame
-  }
+  ) {}
 
   private isRedNumber() {
killedBy: Board Bet ONE_NUMBER win; Board Bet 0 win
statusReason: Error: Expected undefined to equal 3600.

[Killed] ConditionalExpression
src/app/classes/Board.ts:285:9
     multiplier: number,
     exceptionCase = false
   ) {
-    if (exceptionCase) {
+    if (true) {
       throw new Error(`Bet number is not allowed for this game.`)
     }
killedBy: Board Bet ONE_NUMBER win; Board Bet 0 win
statusReason: Error: Bet number is not allowed for this game.

[Killed] BlockStatement
src/app/classes/Board.ts:285:24
     multiplier: number,
     exceptionCase = false
   ) {
-    if (exceptionCase) {
-      throw new Error(`Bet number is not allowed for this game.`)
-    }
+    if (exceptionCase) {}
     return isWin ? betMoney * multiplier : this.payLostGame
   }
killedBy: Board Bet SIX_NUMBERS exception
statusReason: Error: Expected function to throw an Error.

[Killed] StringLiteral
src/app/classes/Board.ts:286:23
     exceptionCase = false
   ) {
     if (exceptionCase) {
-      throw new Error(`Bet number is not allowed for this game.`)
+      throw new Error(``)
     }
     return isWin ? betMoney * multiplier : this.payLostGame
killedBy: Board Bet SIX_NUMBERS exception
statusReason: Error: Expected function to throw an exception with message 'Bet number is not allowed for this game.', but it threw an exception with message ''.

[Killed] ArithmeticOperator
src/app/classes/Board.ts:288:20
     if (exceptionCase) {
       throw new Error(`Bet number is not allowed for this game.`)
     }
-    return isWin ? betMoney * multiplier : this.payLostGame
+    return isWin ? betMoney / multiplier : this.payLostGame
   }
 
killedBy: Board Bet ONE_NUMBER win; Board Bet 0 win
statusReason: Error: Expected 2.7777777777777777 to equal 3600.

[Killed] BlockStatement
src/app/classes/Board.ts:291:25
     return isWin ? betMoney * multiplier : this.payLostGame
   }
 
-  private isRedNumber() {
-    return this.redNumbers.includes(this.spunNumber)
-  }
+  private isRedNumber() {}
 
   private isBlackNumber() {
killedBy: Board Bet RED win
statusReason: Error: Expected 0 to equal 200.

[Killed] BlockStatement
src/app/classes/Board.ts:295:27
     return this.redNumbers.includes(this.spunNumber)
   }
 
-  private isBlackNumber() {
-    return !this.isRedNumber()
-  }
+  private isBlackNumber() {}
 
   private isPremier() {
killedBy: Board Bet BLACK win
statusReason: Error: Expected 0 to equal 200.

[Killed] BooleanLiteral
src/app/classes/Board.ts:296:12
   }
 
   private isBlackNumber() {
-    return !this.isRedNumber()
+    return this.isRedNumber()
   }
 
killedBy: Board Bet BLACK win
statusReason: Error: Expected 0 to equal 200.

[Killed] BlockStatement
src/app/classes/Board.ts:299:23
     return !this.isRedNumber()
   }
 
-  private isPremier() {
-    return this.spunNumber < 13
-  }
+  private isPremier() {}
 
   private isDernier() {
killedBy: Board Bet PREMIER win
statusReason: Error: Expected 0 to equal 300.

[Killed] ConditionalExpression
src/app/classes/Board.ts:300:12
   }
 
   private isPremier() {
-    return this.spunNumber < 13
+    return false
   }
 
killedBy: Board Bet PREMIER win
statusReason: Error: Expected 0 to equal 300.

[Killed] EqualityOperator
src/app/classes/Board.ts:300:12
   }
 
   private isPremier() {
-    return this.spunNumber < 13
+    return this.spunNumber <= 13
   }
 
killedBy: Board Bet PREMIER loose
statusReason: Error: Expected 300 to equal 0.

[Killed] BlockStatement
src/app/classes/Board.ts:303:23
     return this.spunNumber < 13
   }
 
-  private isDernier() {
-    return this.spunNumber > 24
-  }
+  private isDernier() {}
 
   private isMoyen() {
killedBy: Board Bet MOYEN loose with dernier
statusReason: Error: Expected 300 to equal 0.

[Killed] EqualityOperator
src/app/classes/Board.ts:304:12
   }
 
   private isDernier() {
-    return this.spunNumber > 24
+    return this.spunNumber >= 24
   }
 
killedBy: Board Bet DERNIER loose
statusReason: Error: Expected 300 to equal 0.

[Killed] EqualityOperator
src/app/classes/Board.ts:304:12
   }
 
   private isDernier() {
-    return this.spunNumber > 24
+    return this.spunNumber <= 24
   }
 
killedBy: Board Bet MOYEN win
statusReason: Error: Expected 0 to equal 300.

[Killed] BlockStatement
src/app/classes/Board.ts:307:21
     return this.spunNumber > 24
   }
 
-  private isMoyen() {
-    return !(this.isPremier() || this.isDernier())
-  }
+  private isMoyen() {}
 
   private isTopColumn(cell: number = this.spunNumber) {
killedBy: Board Bet MOYEN win
statusReason: Error: Expected 0 to equal 300.

[Killed] BooleanLiteral
src/app/classes/Board.ts:308:12
   }
 
   private isMoyen() {
-    return !(this.isPremier() || this.isDernier())
+    return this.isPremier() || this.isDernier()
   }
 
killedBy: Board Bet MOYEN win
statusReason: Error: Expected 0 to equal 300.

[Killed] LogicalOperator
src/app/classes/Board.ts:308:14
   }
 
   private isMoyen() {
-    return !(this.isPremier() || this.isDernier())
+    return !(this.isPremier() && this.isDernier())
   }
 
killedBy: Board Bet MOYEN loose with premier
statusReason: Error: Expected 300 to equal 0.

[Killed] BlockStatement
src/app/classes/Board.ts:311:55
     return !(this.isPremier() || this.isDernier())
   }
 
-  private isTopColumn(cell: number = this.spunNumber) {
-    return cell % 3 === 1
-  }
+  private isTopColumn(cell: number = this.spunNumber) {}
 
   private isMiddleColumn(cell: number = this.spunNumber) {
killedBy: Board Bet TOP_COLUMN win
statusReason: Error: Expected 0 to equal 300.

[Killed] ArithmeticOperator
src/app/classes/Board.ts:312:12
   }
 
   private isTopColumn(cell: number = this.spunNumber) {
-    return cell % 3 === 1
+    return cell * 3 === 1
   }
 
killedBy: Board Bet TOP_COLUMN win
statusReason: Error: Expected 0 to equal 300.

[Killed] ConditionalExpression
src/app/classes/Board.ts:312:12
   }
 
   private isTopColumn(cell: number = this.spunNumber) {
-    return cell % 3 === 1
+    return true
   }
 
killedBy: Board Bet TOP_COLUMN loose
statusReason: Error: Expected 300 to equal 0.

[Killed] BlockStatement
src/app/classes/Board.ts:315:58
     return cell % 3 === 1
   }
 
-  private isMiddleColumn(cell: number = this.spunNumber) {
-    return cell % 3 === 2
-  }
+  private isMiddleColumn(cell: number = this.spunNumber) {}
 
   private isBottomColumn(cell: number = this.spunNumber) {
killedBy: Board Bet MIDDLE_COLUMN win
statusReason: Error: Expected 0 to equal 300.

[Killed] EqualityOperator
src/app/classes/Board.ts:316:12
   }
 
   private isMiddleColumn(cell: number = this.spunNumber) {
-    return cell % 3 === 2
+    return cell % 3 !== 2
   }
 
killedBy: Board Bet MIDDLE_COLUMN win
statusReason: Error: Expected 0 to equal 300.

[Killed] ArithmeticOperator
src/app/classes/Board.ts:316:12
   }
 
   private isMiddleColumn(cell: number = this.spunNumber) {
-    return cell % 3 === 2
+    return cell * 3 === 2
   }
 
killedBy: Board Bet MIDDLE_COLUMN win
statusReason: Error: Expected 0 to equal 300.

[Killed] BlockStatement
src/app/classes/Board.ts:319:58
     return cell % 3 === 2
   }
 
-  private isBottomColumn(cell: number = this.spunNumber) {
-    return cell % 3 === 0
-  }
+  private isBottomColumn(cell: number = this.spunNumber) {}
 
   private isLastRow(cell: number) {
killedBy: Board Bet BOTTOM_COLUMN win
statusReason: Error: Expected 0 to equal 300.

[Killed] EqualityOperator
src/app/classes/Board.ts:320:12
   }
 
   private isBottomColumn(cell: number = this.spunNumber) {
-    return cell % 3 === 0
+    return cell % 3 !== 0
   }
 
killedBy: Board Bet BOTTOM_COLUMN win
statusReason: Error: Expected 0 to equal 300.

[Killed] ConditionalExpression
src/app/classes/Board.ts:320:12
   }
 
   private isBottomColumn(cell: number = this.spunNumber) {
-    return cell % 3 === 0
+    return true
   }
 
killedBy: Board Bet BOTTOM_COLUMN loose
statusReason: Error: Expected 300 to equal 0.

[Killed] BlockStatement
src/app/classes/Board.ts:323:35
     return cell % 3 === 0
   }
 
-  private isLastRow(cell: number) {
-    return cell > 33
-  }
+  private isLastRow(cell: number) {}
 }
 
killedBy: Board Bet TWO_NUMBERS_VERTICAL exception
statusReason: Error: Expected function to throw an Error.

[Killed] EqualityOperator
src/app/classes/Board.ts:324:12
   }
 
   private isLastRow(cell: number) {
-    return cell > 33
+    return cell <= 33
   }
 }
killedBy: Board Bet TWO_NUMBERS_VERTICAL win
statusReason: Error: Bet number is not allowed for this game.

[Killed] ConditionalExpression
src/app/classes/Board.ts:324:12
   }
 
   private isLastRow(cell: number) {
-    return cell > 33
+    return false
   }
 }
killedBy: Board Bet TWO_NUMBERS_VERTICAL exception
statusReason: Error: Expected function to throw an Error.
