[NoCoverage] BlockStatement
tdd/tdd-start/src/main.ts:7:29
 import { AppModule } from './app/app.module'
 import { environment } from './environments/environment'
 
-if (environment.production) {
-  enableProdMode()
-}
+if (environment.production) {}
 
 platformBrowserDynamic()

[NoCoverage] ArrowFunction
tdd/tdd-start/src/main.ts:13:10
 
 platformBrowserDynamic()
   .bootstrapModule(AppModule)
-  .catch((err) => console.error(err))
+  .catch(() => undefined)
 
