[Killed] BlockStatement
src/app/classes/RouletteDTOValidator.ts:11:37
 export class RouletteDTOValidator {
   static dto: RouletteDTO
 
-  static validate(dto: RouletteDTO) {
-    this.dto = dto
-    this.propertiesExist()
-    this.boardIdValidation()
-  }
+  static validate(dto: RouletteDTO) {}
 
   private static propertiesExist() {
killedBy: RouletteDTOValidator Empty DTO
statusReason: Error: Expected function to throw an Error.

[Killed] BlockStatement
src/app/classes/RouletteDTOValidator.ts:17:36
     this.boardIdValidation()
   }
 
-  private static propertiesExist() {
-    if (Object.keys(this.dto).length === 0) {
-      throw new EmptyRouletteValidationError('')
-    }
-    this.checkProperty('boardId')
-    this.checkProperty('personId')
-    this.checkProperty('betMoney')
-    this.checkProperty('betPlace')
-  }
+  private static propertiesExist() {}
 
   private static checkProperty(property: string) {
killedBy: RouletteDTOValidator Empty DTO
statusReason: Error: Expected function to throw EmptyRouletteValidationError, but it threw NotValidIdRouletteValidationError.

[Killed] BlockStatement
src/app/classes/RouletteDTOValidator.ts:18:45
   }
 
   private static propertiesExist() {
-    if (Object.keys(this.dto).length === 0) {
-      throw new EmptyRouletteValidationError('')
-    }
+    if (Object.keys(this.dto).length === 0) {}
     this.checkProperty('boardId')
     this.checkProperty('personId')
killedBy: RouletteDTOValidator Empty DTO
statusReason: Error: Expected function to throw EmptyRouletteValidationError, but it threw MissingPropertyRouletteValidationError.

[Killed] ConditionalExpression
src/app/classes/RouletteDTOValidator.ts:18:9
   }
 
   private static propertiesExist() {
-    if (Object.keys(this.dto).length === 0) {
+    if (true) {
       throw new EmptyRouletteValidationError('')
     }
killedBy: RouletteDTOValidator Positive case
statusReason: Error: Expected function not to throw an Error, but it threw Error.

[Killed] BlockStatement
src/app/classes/RouletteDTOValidator.ts:27:50
     this.checkProperty('betPlace')
   }
 
-  private static checkProperty(property: string) {
-    if (!(property in this.dto)) {
-      throw new MissingPropertyRouletteValidationError(property)
-    }
-  }
+  private static checkProperty(property: string) {}
 
   private static boardIdValidation() {
killedBy: RouletteDTOValidator No boardId
statusReason: Error: Expected function to throw MissingPropertyRouletteValidationError, but it threw NotValidIdRouletteValidationError.

[Killed] ConditionalExpression
src/app/classes/RouletteDTOValidator.ts:28:9
   }
 
   private static checkProperty(property: string) {
-    if (!(property in this.dto)) {
+    if (false) {
       throw new MissingPropertyRouletteValidationError(property)
     }
killedBy: RouletteDTOValidator No boardId
statusReason: Error: Expected function to throw MissingPropertyRouletteValidationError, but it threw NotValidIdRouletteValidationError.

[Killed] ConditionalExpression
src/app/classes/RouletteDTOValidator.ts:28:9
   }
 
   private static checkProperty(property: string) {
-    if (!(property in this.dto)) {
+    if (true) {
       throw new MissingPropertyRouletteValidationError(property)
     }
killedBy: RouletteDTOValidator Positive case
statusReason: Error: Expected function not to throw an Error, but it threw Error.

[Killed] BlockStatement
src/app/classes/RouletteDTOValidator.ts:33:38
     }
   }
 
-  private static boardIdValidation() {
-    if (this.isNotValidId()) {
-      throw new NotValidIdRouletteValidationError('boardId')
-    }
-  }
+  private static boardIdValidation() {}
 
   private static isNotValidId() {
killedBy: RouletteDTOValidator Null boardId
statusReason: Error: Expected function to throw an Error.

[Killed] BlockStatement
src/app/classes/RouletteDTOValidator.ts:34:30
   }
 
   private static boardIdValidation() {
-    if (this.isNotValidId()) {
-      throw new NotValidIdRouletteValidationError('boardId')
-    }
+    if (this.isNotValidId()) {}
   }
 
killedBy: RouletteDTOValidator Null boardId
statusReason: Error: Expected function to throw an Error.

[Killed] ConditionalExpression
src/app/classes/RouletteDTOValidator.ts:34:9
   }
 
   private static boardIdValidation() {
-    if (this.isNotValidId()) {
+    if (true) {
       throw new NotValidIdRouletteValidationError('boardId')
     }
killedBy: RouletteDTOValidator Positive case
statusReason: Error: Expected function not to throw an Error, but it threw Error.

[Killed] StringLiteral
src/app/classes/RouletteDTOValidator.ts:35:51
 
   private static boardIdValidation() {
     if (this.isNotValidId()) {
-      throw new NotValidIdRouletteValidationError('boardId')
+      throw new NotValidIdRouletteValidationError("")
     }
   }
killedBy: RouletteDTOValidator Null boardId
statusReason: Error: Expected function to throw an exception with message 'boardId', but it threw an exception with message ''.

[Killed] BlockStatement
src/app/classes/RouletteDTOValidator.ts:39:33
     }
   }
 
-  private static isNotValidId() {
-    return (
-      this.dto.boardId === null ||
-      isNaN(this.dto.boardId) ||
-      this.dto.boardId === Infinity ||
-      this.dto.boardId === -Infinity ||
-      this.dto.boardId <= 0
-    )
-  }
+  private static isNotValidId() {}
 }
 
killedBy: RouletteDTOValidator Null boardId
statusReason: Error: Expected function to throw an Error.

[Killed] EqualityOperator
src/app/classes/RouletteDTOValidator.ts:41:7
 
   private static isNotValidId() {
     return (
-      this.dto.boardId === null ||
+      this.dto.boardId !== null ||
       isNaN(this.dto.boardId) ||
       this.dto.boardId === Infinity ||
killedBy: RouletteDTOValidator Positive case
statusReason: Error: Expected function not to throw an Error, but it threw Error.

[Killed] ConditionalExpression
src/app/classes/RouletteDTOValidator.ts:41:7
 
   private static isNotValidId() {
     return (
-      this.dto.boardId === null ||
-      isNaN(this.dto.boardId) ||
-      this.dto.boardId === Infinity ||
-      this.dto.boardId === -Infinity ||
-      this.dto.boardId <= 0
+      true
     )
   }
killedBy: RouletteDTOValidator Positive case
statusReason: Error: Expected function not to throw an Error, but it threw Error.

[Killed] EqualityOperator
src/app/classes/RouletteDTOValidator.ts:43:7
     return (
       this.dto.boardId === null ||
       isNaN(this.dto.boardId) ||
-      this.dto.boardId === Infinity ||
+      this.dto.boardId !== Infinity ||
       this.dto.boardId === -Infinity ||
       this.dto.boardId <= 0
killedBy: RouletteDTOValidator Positive case
statusReason: Error: Expected function not to throw an Error, but it threw Error.

[Killed] ConditionalExpression
src/app/classes/RouletteDTOValidator.ts:43:7
     return (
       this.dto.boardId === null ||
       isNaN(this.dto.boardId) ||
-      this.dto.boardId === Infinity ||
+      false ||
       this.dto.boardId === -Infinity ||
       this.dto.boardId <= 0
killedBy: RouletteDTOValidator Too big number boardId
statusReason: Error: Expected function to throw an Error.

[Killed] EqualityOperator
src/app/classes/RouletteDTOValidator.ts:44:7
       this.dto.boardId === null ||
       isNaN(this.dto.boardId) ||
       this.dto.boardId === Infinity ||
-      this.dto.boardId === -Infinity ||
+      this.dto.boardId !== -Infinity ||
       this.dto.boardId <= 0
     )
killedBy: RouletteDTOValidator Positive case
statusReason: Error: Expected function not to throw an Error, but it threw Error.

[Survived] UnaryOperator
src/app/classes/RouletteDTOValidator.ts:44:28
       this.dto.boardId === null ||
       isNaN(this.dto.boardId) ||
       this.dto.boardId === Infinity ||
-      this.dto.boardId === -Infinity ||
+      this.dto.boardId === +Infinity ||
       this.dto.boardId <= 0
     )

[Killed] EqualityOperator
src/app/classes/RouletteDTOValidator.ts:45:7
       isNaN(this.dto.boardId) ||
       this.dto.boardId === Infinity ||
       this.dto.boardId === -Infinity ||
-      this.dto.boardId <= 0
+      this.dto.boardId > 0
     )
   }
killedBy: RouletteDTOValidator Positive case
statusReason: Error: Expected function not to throw an Error, but it threw Error.

[Killed] ConditionalExpression
src/app/classes/RouletteDTOValidator.ts:45:7
       isNaN(this.dto.boardId) ||
       this.dto.boardId === Infinity ||
       this.dto.boardId === -Infinity ||
-      this.dto.boardId <= 0
+      false
     )
   }
killedBy: RouletteDTOValidator Negative boardId
statusReason: Error: Expected function to throw an Error.
