[Killed] BlockStatement
src/app/classes/RouletteError.ts:2:28
 export class RouletteError extends Error {
-  constructor(msg: string) {
-    super(msg)
-    Object.setPrototypeOf(this, RouletteError.prototype)
-  }
+  constructor(msg: string) {}
 }
 
killedBy: RouletteDTOValidator Empty DTO
statusReason: Error: Expected function to throw EmptyRouletteValidationError, but it threw ReferenceError.
