[Killed] BlockStatement
src/app/classes/RouletteValidationError.ts:4:32
 import { RouletteError } from './RouletteError'
 
 export class RouletteValidationError extends RouletteError {
-  constructor(message: string) {
-    super(message)
-    Object.setPrototypeOf(this, RouletteValidationError.prototype)
-  }
+  constructor(message: string) {}
 }
 
killedBy: RouletteDTOValidator Empty DTO
statusReason: Error: Expected function to throw EmptyRouletteValidationError, but it threw ReferenceError.

[Killed] BlockStatement
src/app/classes/RouletteValidationError.ts:11:32
 }
 
 export class EmptyRouletteValidationError extends RouletteValidationError {
-  constructor(message: string) {
-    super(message)
-    Object.setPrototypeOf(this, EmptyRouletteValidationError.prototype)
-  }
+  constructor(message: string) {}
 }
 
killedBy: RouletteDTOValidator Empty DTO
statusReason: Error: Expected function to throw EmptyRouletteValidationError, but it threw ReferenceError.

[Killed] BlockStatement
src/app/classes/RouletteValidationError.ts:18:32
 }
 
 export class MissingPropertyRouletteValidationError extends RouletteValidationError {
-  constructor(message: string) {
-    super(message)
-    Object.setPrototypeOf(
-      this,
-      MissingPropertyRouletteValidationError.prototype
-    )
-  }
+  constructor(message: string) {}
 }
 export class NotValidIdRouletteValidationError extends RouletteValidationError {
killedBy: RouletteDTOValidator No boardId
statusReason: Error: Expected function to throw MissingPropertyRouletteValidationError, but it threw ReferenceError.

[Killed] BlockStatement
src/app/classes/RouletteValidationError.ts:27:32
   }
 }
 export class NotValidIdRouletteValidationError extends RouletteValidationError {
-  constructor(message: string) {
-    super(message)
-    Object.setPrototypeOf(this, NotValidIdRouletteValidationError.prototype)
-  }
+  constructor(message: string) {}
 }
 
killedBy: RouletteDTOValidator Null boardId
statusReason: Error: Expected function to throw NotValidIdRouletteValidationError, but it threw ReferenceError.
